{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 165,
   "metadata": {},
   "outputs": [],
   "source": [
    "import tkinter as tk\n",
    "from tkinter import ttk\n",
    "from tkinter import messagebox\n",
    "\n",
    "from pyfuseki import FusekiUpdate\n",
    "from pyfuseki.utils import RdfUtils\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, TURTLE\n",
    "from rdflib import Graph, RDFS, URIRef, Namespace, RDF, Literal\n",
    "\n",
    "import networkx as nx\n",
    "from PIL import Image, ImageTk\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "import copy\n",
    "import string\n",
    "import random"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 166,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Application(tk.Frame):\n",
    "  # treeview Widgetの情報を格納する変数\n",
    "  treeview = None\n",
    "\n",
    "  def __init__(self, master=None):\n",
    "    # Windowの初期設定を行う。\n",
    "    super().__init__(master)\n",
    "    self.master = master\n",
    "    self.master.title(\"Fuseki Brower\")\n",
    "    self.master.geometry(\"1250x650\")\n",
    "    #self.pack()\n",
    "\n",
    "    self.prefix_grpah_data = {}\n",
    "    self.ttl_file = 'ttl_file.ttl'\n",
    "    self.selected_graph = ''\n",
    "    self.selected_graph_name = ''\n",
    "    self.gpm_uri = ''\n",
    "    self.graph_node_list = []\n",
    "    self.graph_edge_list = []\n",
    "    self.graph_label_list = {}\n",
    "    self.graph_position = {}\n",
    "    # 表示しているグラフの層を記録\n",
    "    self.graph_level = ''\n",
    "    self.create_widgets()\n",
    "\n",
    "  def create_widgets(self):\n",
    "    #------------------------------------------------------------------\n",
    "    # LabelFrame\n",
    "    #------------------------------------------------------------------\n",
    "    frame_options = {\"bd\": 2, \"relief\": \"ridge\", \"foreground\": \"green\"}\n",
    "\n",
    "    self.frame_ep_info_list = tk.LabelFrame(self.master, text=\" Graph Info\", width=500, height=120,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_ep_info_list.place(x=495,y=0)\n",
    "\n",
    "    self.frame_hierarchy_list = tk.LabelFrame(self.master, text=\"Node List\", width=500, height=240,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_hierarchy_list.place(x=495,y=140)\n",
    "\n",
    "    self.frame_node = tk.LabelFrame(self.master, text=\"Infromation\", width=300, height=300,\\\n",
    "                                    **frame_options)\n",
    "    self.frame_node.place(x=710, y=0)\n",
    "\n",
    "    self.frame_node_info = tk.LabelFrame(self.frame_node, width=300, height=300,\\\n",
    "                                        **frame_options)\n",
    "    self.frame_node_info.grid(row=0, column=0)\n",
    "\n",
    "    self.frame_supplement_info = tk.LabelFrame(self.frame_node, width=300, height=300,\\\n",
    "                                              **frame_options)\n",
    "    self.frame_supplement_info.grid(row=1, column=0)\n",
    "\n",
    "    self.frame_new_gpm_list = tk.LabelFrame(self.master, text=\"GPM List\", width=300, height=200,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_new_gpm_list.place(x=495, y=410)\n",
    "\n",
    "    self.frame_document_list = tk.LabelFrame(self.master, text=\"Document List\", width=150, height=140,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_document_list.place(x=760, y=410)\n",
    "    \n",
    "    self.frame_engineer_list = tk.LabelFrame(self.master, text=\"Engineer List\", width=150, height=140,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_engineer_list.place(x=910, y=410)\n",
    "    \n",
    "    self.frame_lld_list = tk.LabelFrame(self.master, text=\"LLD List\", width=150, height=140,\\\n",
    "                                            **frame_options)\n",
    "    self.frame_lld_list.place(x=1060, y=410)\n",
    "\n",
    "    self.frame_button = tk.LabelFrame(self.master, text=\"Button\", width=550, height=70,\\\n",
    "                                      **frame_options)\n",
    "    self.frame_button.place(x=495, y=550)\n",
    "\n",
    "    self.frame_relation = tk.LabelFrame(self.master, text=\"Relation List\", width=300, height=300,\\\n",
    "                                    **frame_options)\n",
    "    self.frame_relation.place(x=1040, y=0)\n",
    "\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (Graph Info)\n",
    "    #------------------------------------------------------------------\n",
    "    self.scrollbar_ep_info_x = tk.Scrollbar(self.frame_ep_info_list, orient=tk.HORIZONTAL)\n",
    "    self.scrollbar_ep_info_x.pack(side=\"bottom\", fill=\"x\")\n",
    "    self.scrollbar_ep_info_y = tk.Scrollbar(self.frame_ep_info_list, orient=tk.VERTICAL)\n",
    "    self.scrollbar_ep_info_y.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    self.listbox_ep_value = tk.StringVar()\n",
    "    self.graph_list = self.get_graph()\n",
    "    self.listbox_ep_value.set(self.graph_list)\n",
    "    self.listbox_ep_info = tk.Listbox(self.frame_ep_info_list, height=6, width=30, selectmode=tk.SINGLE,\\\n",
    "                            listvariable=self.listbox_ep_value, \\\n",
    "                            exportselection=False, xscrollcommand=self.scrollbar_ep_info_x.set,\\\n",
    "                            yscrollcommand=self.scrollbar_ep_info_y.set)  \n",
    "    self.listbox_ep_info.pack(fill=\"both\")\n",
    "    self.listbox_ep_info.bind(\"<<ListboxSelect>>\", select_graph)\n",
    "\n",
    "    self.scrollbar_ep_info_x.config(command=self.listbox_ep_info.xview)\n",
    "    self.scrollbar_ep_info_y.config(command=self.listbox_ep_info.yview)\n",
    "\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (Document)\n",
    "    #------------------------------------------------------------------\n",
    "    self.scrollbar_document_x = tk.Scrollbar(self.frame_document_list, orient=tk.HORIZONTAL)\n",
    "    self.scrollbar_document_x.pack(side=\"bottom\", fill=\"x\")\n",
    "    self.scrollbar_document_y = tk.Scrollbar(self.frame_document_list, orient=tk.VERTICAL)\n",
    "    self.scrollbar_document_y.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    self.listbox_document_value = tk.StringVar()\n",
    "    self.graph_list = self.get_graph()\n",
    "    self.listbox_document_value.set(self.graph_list)\n",
    "    self.listbox_document = tk.Listbox(self.frame_document_list, height=6, width=30, selectmode=tk.SINGLE,\\\n",
    "                            listvariable='', \\\n",
    "                            exportselection=False, xscrollcommand=self.scrollbar_document_x.set,\\\n",
    "                            yscrollcommand=self.scrollbar_document_y.set)  \n",
    "    self.listbox_document.pack(fill=\"both\")\n",
    "    # self.listbox_document.bind(\"<<ListboxSelect>>\", select_graph)\n",
    "\n",
    "    self.scrollbar_document_x.config(command=self.listbox_document.xview)\n",
    "    self.scrollbar_document_y.config(command=self.listbox_document.yview)\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (Engineer)\n",
    "    #------------------------------------------------------------------\n",
    "    self.scrollbar_engineer_x = tk.Scrollbar(self.frame_engineer_list, orient=tk.HORIZONTAL)\n",
    "    self.scrollbar_engineer_x.pack(side=\"bottom\", fill=\"x\")\n",
    "    self.scrollbar_engineer_y = tk.Scrollbar(self.frame_engineer_list, orient=tk.VERTICAL)\n",
    "    self.scrollbar_engineer_y.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    self.listbox_engineer_value = tk.StringVar()\n",
    "    self.graph_list = self.get_graph()\n",
    "    self.listbox_engineer_value.set(self.graph_list)\n",
    "    self.listbox_engineer = tk.Listbox(self.frame_engineer_list, height=6, width=30, selectmode=tk.SINGLE,\\\n",
    "                            listvariable='', \\\n",
    "                            exportselection=False, xscrollcommand=self.scrollbar_engineer_x.set,\\\n",
    "                            yscrollcommand=self.scrollbar_engineer_y.set)  \n",
    "    self.listbox_engineer.pack(fill=\"both\")\n",
    "    # self.listbox_engineer.bind(\"<<ListboxSelect>>\", select_graph)\n",
    "\n",
    "    self.scrollbar_engineer_x.config(command=self.listbox_engineer.xview)\n",
    "    self.scrollbar_engineer_y.config(command=self.listbox_engineer.yview)\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (LLD)\n",
    "    #------------------------------------------------------------------\n",
    "    self.scrollbar_lld_x = tk.Scrollbar(self.frame_lld_list, orient=tk.HORIZONTAL)\n",
    "    self.scrollbar_lld_x.pack(side=\"bottom\", fill=\"x\")\n",
    "    self.scrollbar_lld_y = tk.Scrollbar(self.frame_lld_list, orient=tk.VERTICAL)\n",
    "    self.scrollbar_lld_y.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    self.listbox_lld_value = tk.StringVar()\n",
    "    self.graph_list = self.get_graph()\n",
    "    self.listbox_lld_value.set(self.graph_list)\n",
    "    self.listbox_lld = tk.Listbox(self.frame_lld_list, height=6, width=30, selectmode=tk.SINGLE,\\\n",
    "                            listvariable='', \\\n",
    "                            exportselection=False, xscrollcommand=self.scrollbar_lld_x.set,\\\n",
    "                            yscrollcommand=self.scrollbar_lld_y.set)  \n",
    "    self.listbox_lld.pack(fill=\"both\")\n",
    "    # self.listbox_lld.bind(\"<<ListboxSelect>>\", select_graph)\n",
    "\n",
    "    self.scrollbar_lld_x.config(command=self.listbox_lld.xview)\n",
    "    self.scrollbar_lld_y.config(command=self.listbox_lld.yview)\n",
    "    #------------------------------------------------------------------\n",
    "    # treeview widget\n",
    "    #------------------------------------------------------------------\n",
    "    self.treeview = ttk.Treeview(self.frame_hierarchy_list)\n",
    "    # 階層列設定\n",
    "    self.treeview.column(\"#0\", width=180, minwidth=500)\n",
    "    # 階層列(ツリーカラム)の見出し設定。階層列とする。\n",
    "    self.treeview.heading(\"#0\")\n",
    "    self.treeview.bind(\"<<TreeviewSelect>>\", tree_select)\n",
    "    self.treeview.grid(row=1, column=1, sticky=\"nsew\")\n",
    "\n",
    "    tree_scrollbar_y = ttk.Scrollbar(self.frame_hierarchy_list, orient=\"vertical\",\\\n",
    "                      command=self.treeview.yview)\n",
    "    tree_scrollbar_y.grid(row=1, column=2, sticky=\"nsew\")\n",
    "    self.treeview.configure(yscrollcommand=tree_scrollbar_y.set)\n",
    "\n",
    "    tree_scrollbar_x = ttk.Scrollbar(self.frame_hierarchy_list, orient=\"horizontal\",\\\n",
    "                      command=self.treeview.xview)\n",
    "    tree_scrollbar_x.grid(row=2, column=1, sticky=\"nsew\")\n",
    "    self.treeview.configure(xscrollcommand=tree_scrollbar_x.set)\n",
    "    #------------------------------------------------------------------\n",
    "    # label (node info title)\n",
    "    #------------------------------------------------------------------\n",
    "    self.node_info_id = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Id:\\t                         \", relief=\"raised\")\n",
    "\n",
    "    self.node_info_id.grid(row=0, column=0)\n",
    "\n",
    "    self.node_info_actionType = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"ActionType:\\t         \", relief=\"raised\")\n",
    "    self.node_info_actionType.grid(row=1, column=0)\n",
    "\n",
    "    self.node_info_height = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"GeoBoundingHeight:     \", relief=\"raised\")\n",
    "    self.node_info_height.grid(row=2, column=0)\n",
    "\n",
    "    self.node_info_width = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"GeoBoundingWidth:      \", relief=\"raised\")\n",
    "    self.node_info_width.grid(row=3, column=0)\n",
    "\n",
    "    self.node_info_posx = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"GeoBoundingX:\\t          \", relief=\"raised\")\n",
    "    self.node_info_posx.grid(row=4, column=0)\n",
    "\n",
    "    self.node_info_posy = tk.Label(self.frame_node_info, justify=\"left\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"GeoBoundingY:              \", relief=\"raised\")\n",
    "    self.node_info_posy.grid(row=5, column=0)\n",
    "\n",
    "    self.node_info_layer = tk.Label(self.frame_node_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Layer:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_layer.grid(row=6, column=0, sticky=tk.N)\n",
    "\n",
    "    self.node_info_value = tk.Label(self.frame_node_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Value:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_value.grid(row=7, column=0, sticky=tk.N)\n",
    "    #------------------------------------------------------------------\n",
    "    # label (node info data)\n",
    "    #------------------------------------------------------------------\n",
    "    self.node_info_id_text = tk.StringVar()\n",
    "    self.id_info = tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_id_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.id_info.grid(row=0, column=1)\n",
    "\n",
    "    self.node_info_action_text = tk.StringVar()\n",
    "    self.action_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_action_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.action_info.grid(row=1, column=1)\n",
    "\n",
    "    self.node_info_height_text = tk.StringVar()\n",
    "    self.height_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_height_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.height_info.grid(row=2, column=1)\n",
    "\n",
    "    self.node_info_width_text = tk.StringVar()\n",
    "    self.width_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_width_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.width_info.grid(row=3, column=1)\n",
    "\n",
    "    self.node_info_posx_text = tk.StringVar()\n",
    "    self.posx_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_posx_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.posx_info.grid(row=4, column=1)\n",
    "\n",
    "    self.node_info_posy_text = tk.StringVar()\n",
    "    self.posy_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_posy_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.posy_info.grid(row=5, column=1)\n",
    "\n",
    "    self.node_info_layer_text = tk.StringVar()\n",
    "    self.layer_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_layer_text,\\\n",
    "                              width=23, relief=\"ridge\")\n",
    "    self.layer_info.grid(row=6, column=1)\n",
    "\n",
    "    self.node_info_value_text = tk.StringVar()\n",
    "    self.value_info= tk.Label(self.frame_node_info, justify=\"left\", textvariable=self.node_info_value_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.value_info.grid(row=7, column=1)\n",
    "    #------------------------------------------------------------------\n",
    "    # label (supplement info title)\n",
    "    #------------------------------------------------------------------\n",
    "    self.node_info_intention = tk.Label(self.frame_supplement_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Intention:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_intention.grid(row=0, column=0, sticky=tk.N)\n",
    "\n",
    "    self.node_info_rationale = tk.Label(self.frame_supplement_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Rationale:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_rationale.grid(row=1, column=0, sticky=tk.N)\n",
    "\n",
    "    self.node_info_annotation = tk.Label(self.frame_supplement_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Annotation:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_annotation.grid(row=2, column=0, sticky=tk.N)\n",
    "\n",
    "    self.node_info_tool = tk.Label(self.frame_supplement_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Tool:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_tool.grid(row=3, column=0, sticky=tk.N)\n",
    "\n",
    "    self.node_info_object = tk.Label(self.frame_supplement_info, justify=\"right\", \\\n",
    "      font=(\"MSゴシック\", \"8\", \"bold\"), width=20, text=\"Object:        \\t          \", relief=\"raised\")\n",
    "    self.node_info_object.grid(row=4, column=0, sticky=tk.N)\n",
    "    #------------------------------------------------------------------\n",
    "    # label (supplement info data)\n",
    "    #------------------------------------------------------------------\n",
    "    self.intention_text = tk.StringVar()\n",
    "    self.intention_info = tk.Label(self.frame_supplement_info, justify=\"left\", textvariable=self.intention_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.intention_info.grid(row=0, column=1)\n",
    "\n",
    "    self.rationale_text = tk.StringVar()\n",
    "    self.rationale_info = tk.Label(self.frame_supplement_info, justify=\"left\", textvariable=self.rationale_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.rationale_info.grid(row=1, column=1)\n",
    "\n",
    "    self.annotation_text = tk.StringVar()\n",
    "    self.annotation_info = tk.Label(self.frame_supplement_info, justify=\"left\", textvariable=self.annotation_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.annotation_info.grid(row=2, column=1)\n",
    "\n",
    "    self.tool_text = tk.StringVar()\n",
    "    self.tool_info = tk.Label(self.frame_supplement_info, justify=\"left\", textvariable=self.tool_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.tool_info.grid(row=3, column=1)\n",
    "\n",
    "    self.object_text = tk.StringVar()\n",
    "    self.object_info = tk.Label(self.frame_supplement_info, justify=\"left\", textvariable=self.object_text,\\\n",
    "                              width=23, wraplength=130, relief=\"ridge\")\n",
    "    self.object_info.grid(row=4, column=1)\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (GPM uri Info)\n",
    "    #------------------------------------------------------------------\n",
    "    self.scrollbar_gpm_uri_list_x = tk.Scrollbar(self.frame_new_gpm_list, orient=tk.HORIZONTAL)\n",
    "    self.scrollbar_gpm_uri_list_x.pack(side=\"bottom\", fill=\"x\")\n",
    "    self.scrollbar_gpm_uri_list_y = tk.Scrollbar(self.frame_new_gpm_list, orient=tk.VERTICAL)\n",
    "    self.scrollbar_gpm_uri_list_y.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    self.listbox_gpm_uri_value = tk.StringVar()\n",
    "    self.listbox_gpm_uri_list = tk.Listbox(self.frame_new_gpm_list, height=6, width=30, selectmode=tk.SINGLE,\\\n",
    "                            listvariable=self.listbox_gpm_uri_value, \\\n",
    "                            exportselection=False, xscrollcommand=self.scrollbar_gpm_uri_list_x.set,\\\n",
    "                            yscrollcommand=self.scrollbar_gpm_uri_list_y.set)  \n",
    "    self.listbox_gpm_uri_list.pack(fill=\"both\")\n",
    "    #self.listbox_new_gpm_list.bind(\"<<ListboxSelect>>\", uri_select)\n",
    "\n",
    "    self.scrollbar_gpm_uri_list_x.config(command=self.listbox_gpm_uri_list.xview)\n",
    "    self.scrollbar_gpm_uri_list_y.config(command=self.listbox_gpm_uri_list.yview)\n",
    "    #------------------------------------------------------------------\n",
    "    # listbox widget (relation type)\n",
    "    #------------------------------------------------------------------\n",
    "    self.list_relation_type_data = tk.StringVar()\n",
    "    data = ['use', 'member']\n",
    "    self.list_relation_type_data.set(data)\n",
    "    self.list_relation_type = tk.Listbox(self.frame_relation, height=5, \\\n",
    "                            listvariable=self.list_relation_type_data,\\\n",
    "                            selectmode=tk.SINGLE, exportselection=False)\n",
    "    self.list_relation_type.pack(fill=\"both\")\n",
    "\n",
    "    #------------------------------------------------------------------\n",
    "    # Button widget\n",
    "    #------------------------------------------------------------------\n",
    "    self.button_gpm_set = tk.Button(self.frame_button, text=\" GPM設定 \", width=7, height=2, command=set_gpm)\n",
    "    self.button_gpm_set.grid(row=1, column=0, padx=5)\n",
    "\n",
    "    self.button_relation = tk.Button(self.frame_button, text=\" 関連付け \", width=7, height=2,\\\n",
    "                        command=set_relation)\n",
    "    self.button_relation.grid(row=1, column=1, padx=5)\n",
    "\n",
    "    self.button_export = tk.Button(self.frame_button, text=\" Fuseki Export \", width=10, height=2,\\\n",
    "                        command=fuseki_export)\n",
    "    self.button_export.grid(row=1, column=2, padx=5)\n",
    "\n",
    "    self.button_document = tk.Button(self.frame_button, text=\" 知識文書 \", width=7, height=2,\\\n",
    "                        command=lambda: self.insert_document_list(self))\n",
    "    self.button_document.grid(row=1, column=3, padx=5)\n",
    "    \n",
    "    self.button_engineer = tk.Button(self.frame_button, text=\" 技術者 \", width=7, height=2,\\\n",
    "                        command=lambda: self.insert_engineer_list(self))\n",
    "    self.button_engineer.grid(row=1, column=4, padx=5)\n",
    "    \n",
    "    self.button_lld = tk.Button(self.frame_button, text=\" 過去事例 \", width=7, height=2,\\\n",
    "                        command=lambda: self.insert_lld_list(self))\n",
    "    self.button_lld.grid(row=1, column=5, padx=5)\n",
    "    #------------------------------------------------------------------\n",
    "    # canvas\n",
    "    #------------------------------------------------------------------\n",
    "    self.graph_canvas = tk.Canvas(self.master)\n",
    "    self.graph_canvas.place(x=0, y=0, width=480, height=600)\n",
    "    #canvas スクロールバー\n",
    "    self.canvas_bar_y = tk.Scrollbar(self.graph_canvas, orient=tk.VERTICAL)\n",
    "    self.canvas_bar_x = tk.Scrollbar(self.graph_canvas, orient=tk.HORIZONTAL)\n",
    "    self.canvas_bar_y.pack(side=tk.RIGHT, fill=tk.Y)\n",
    "    self.canvas_bar_x.pack(side=tk.BOTTOM, fill=tk.X)\n",
    "    self.canvas_bar_y.config(command=self.graph_canvas.yview)\n",
    "    self.canvas_bar_x.config(command=self.graph_canvas.xview)\n",
    "    self.graph_canvas.config(yscrollcommand=self.canvas_bar_y.set, xscrollcommand=self.canvas_bar_x.set)\n",
    "    # Canvasのスクロール範囲を設定\n",
    "    self.graph_canvas.config(scrollregion=(0, 0, 1000, 1000))\n",
    "  #------------------------------------------------------------------\n",
    "  # 検索結果をリストに表示\n",
    "  #------------------------------------------------------------------  \n",
    "  def insert_lld_list(self, event):\n",
    "    self.listbox_lld.delete(0, tk.END)\n",
    "    lld_action_list = self.fetch_lld_action(app.selected_graph, self.node_info_value_text.get())\n",
    "    self.listbox_lld.insert(tk.END, *lld_action_list)\n",
    "\n",
    "  def insert_document_list(self, event):\n",
    "    self.listbox_document.delete(0, tk.END)\n",
    "    document_list = self.fetch_document(app.selected_graph, self.node_info_value_text.get())\n",
    "    print(document_list)\n",
    "    self.listbox_document.insert(tk.END, *document_list)\n",
    "\n",
    "  def insert_engineer_list(self, event):\n",
    "    self.listbox_engineer.delete(0, tk.END)\n",
    "    engineer_list = self.fetch_engineer(app.selected_graph, self.node_info_value_text.get())\n",
    "    self.listbox_engineer.insert(tk.END, *engineer_list)\n",
    "  #------------------------------------------------------------------\n",
    "  # 階層Topノードを取得\n",
    "  #------------------------------------------------------------------\n",
    "  def get_top_node_list(self):\n",
    "\n",
    "    #最上層アクションを取得\n",
    "    query = \"\"\"\n",
    "          PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "          SELECT ?id ?value\n",
    "          WHERE {\n",
    "                graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                  ?s ?p pd3:Action;\n",
    "                    pd3:id ?id;\n",
    "                    pd3:value ?value.\n",
    "                  FILTER NOT EXISTS {?s pd3:attribution ?parent}\n",
    "              }\n",
    "          }\n",
    "    \"\"\"\n",
    "    self.node_list = {}\n",
    "    self.node_list[\"top\"] = []\n",
    "    self.node_id_list = {}\n",
    "    self.node_id_list[\"top\"] = []\n",
    "    #★\n",
    "    self.treeview_item_list = {}\n",
    "    self.treeview_item_list[\"top\"] = []\n",
    "    #★end\n",
    "    query_result = get_fuseki_data_json(query)\n",
    "    for result in query_result:\n",
    "      value = result[\"value\"][\"value\"]\n",
    "      id = result[\"id\"][\"value\"]\n",
    "      self.node_list[\"top\"].append(value)\n",
    "      self.node_id_list[\"top\"].append(id)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # 階層ノード情報設定\n",
    "  #------------------------------------------------------------------\n",
    "  def get_hierarchy_node_list(self, GPM_uri):\n",
    "\n",
    "    # 元のtreeviewを削除\n",
    "    if(app.treeview.get_children):\n",
    "      for item in app.treeview.get_children():\n",
    "        app.treeview.delete(item)\n",
    "\n",
    "    #グラフにあるコンテナ数を取得\n",
    "    query = \"\"\"\n",
    "    PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "    SELECT (COUNT(?s) AS ?count)\n",
    "    WHERE {\n",
    "          graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "            ?s ?p pd3:Container;\n",
    "            pd3:value ?value.\n",
    "        }\n",
    "    }\n",
    "    \"\"\"\n",
    "    query_result = get_fuseki_data_json(query)\n",
    "    for result in query_result:\n",
    "      container_count = int(result[\"count\"][\"value\"])\n",
    "\n",
    "    self.get_top_node_list()\n",
    "\n",
    "    # Top node listに選択したuri以外のnodeを削除\n",
    "    top_node_list = copy.copy(self.node_list[\"top\"])\n",
    "    top_node_id_list = copy.copy(self.node_id_list[\"top\"])\n",
    "\n",
    "    for index, top_node in enumerate(top_node_list):\n",
    "      if(not top_node in self.top_node_list_uri[GPM_uri]):\n",
    "        self.node_list[\"top\"].remove(top_node)\n",
    "        delete_node_id = top_node_id_list[index]\n",
    "        self.node_id_list[\"top\"].remove(delete_node_id)\n",
    "\n",
    "    for node in self.node_list[\"top\"]:\n",
    "      parent = self.treeview.insert(\"\", tk.END, text=node, open=False)\n",
    "      #★\n",
    "      self.treeview_item_list[\"top\"].append(parent)\n",
    "      #★end\n",
    "      self.get_member_node_list(node, container_count, parent)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # member情報を取得\n",
    "  #------------------------------------------------------------------\n",
    "  def get_member_node_list(self, top_node, count, parent_node):\n",
    "\n",
    "    if(count == 0):\n",
    "      return\n",
    "\n",
    "    #★\n",
    "    top_node = top_node.replace(\"<br>\",\"\")\n",
    "    #★end\n",
    "    query_top_node = '\"' + top_node + '\"'\n",
    "    query = \"\"\"\n",
    "    PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "    SELECT ?s\n",
    "    WHERE {\n",
    "          graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "            ?s ?p pd3:Container;\n",
    "            pd3:value ?value.\n",
    "        FILTER(?value = \"\"\" + query_top_node + \"\"\" )\n",
    "        }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    query_result = get_fuseki_data_json(query)\n",
    "    if(len(query_result) > 0):\n",
    "      self.node_list[top_node] = []\n",
    "      self.node_id_list[top_node] = []\n",
    "      #★\n",
    "      self.treeview_item_list[top_node]= []\n",
    "      #★end\n",
    "      count -= 1\n",
    "      for result in query_result:\n",
    "        container = result[\"s\"][\"value\"]\n",
    "\n",
    "      query_2 = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      SELECT ?id ?value\n",
    "      WHERE {\n",
    "            graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "              ?s ?p pd3:Action;\n",
    "              pd3:attribution ?parent;\n",
    "              pd3:id ?id;\n",
    "              pd3:value ?value.\n",
    "          FILTER(?parent = <\"\"\" + container + \"\"\"> )\n",
    "          }\n",
    "      }\n",
    "      \"\"\"\n",
    "      query_result = get_fuseki_data_json(query_2)\n",
    "      for result in query_result:\n",
    "        value = result[\"value\"][\"value\"]\n",
    "        id = result[\"id\"][\"value\"]\n",
    "        self.node_list[top_node].append(value)\n",
    "        self.node_id_list[top_node].append(id)\n",
    "        #return self.get_member_node_list(value, count)\n",
    "\n",
    "      for node in self.node_list[top_node]:\n",
    "        child = self.treeview.insert(parent_node, tk.END, text=node, open=False)\n",
    "        #★\n",
    "        self.treeview_item_list[top_node].append(child)\n",
    "        #★end\n",
    "        self.get_member_node_list(node, count, child)\n",
    "    else:\n",
    "      return\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # Fusekiからgraphを取得\n",
    "  #------------------------------------------------------------------\n",
    "  def get_graph(self):\n",
    "    query= \"\"\"PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "          select distinct ?graph\n",
    "          where {\n",
    "                  graph ?graph {\n",
    "                    ?s ?p ?o;\n",
    "                  }\n",
    "          }\"\"\"\n",
    "    graph_list = []\n",
    "\n",
    "    results = get_fuseki_data_json(query)\n",
    "    for result in results:\n",
    "      graph = result[\"graph\"][\"value\"]\n",
    "      graph_list.append(graph)\n",
    "\n",
    "    #print(graph_list)\n",
    "    return(graph_list)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # New GPM listを取得\n",
    "  #------------------------------------------------------------------\n",
    "  def get_gpm_uri_list(self, node_list):\n",
    "\n",
    "    self.top_node_list_uri = {}\n",
    "    for node in self.node_list['top']:\n",
    "      index = 0\n",
    "      # nodeのuriを取得\n",
    "      #★\n",
    "      node_str = '\"' + node + '\"'\n",
    "      query = \"\"\"\n",
    "          PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "          SELECT ?s ?id\n",
    "          WHERE {\n",
    "                graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                  ?s ?p pd3:Action;\n",
    "                  pd3:value ?value;\n",
    "                  pd3:id ?id\n",
    "                  FILTER(?value = \"\"\" + node_str + \"\"\")\n",
    "                  FILTER NOT EXISTS {?s pd3:attribution ?parent} \n",
    "              }\n",
    "          }\n",
    "          \"\"\"\n",
    "      query_result = get_fuseki_data_json(query)\n",
    "      for result in query_result:\n",
    "        temp_subject = result[\"s\"][\"value\"]\n",
    "        id = result[\"id\"][\"value\"]\n",
    "        node_subject = temp_subject.replace(id, \"\")\n",
    "        if(node_subject not in self.top_node_list_uri):\n",
    "          self.top_node_list_uri[node_subject]=[]\n",
    "          self.listbox_gpm_uri_list.insert(index, node_subject)\n",
    "          index += 1\n",
    "        self.top_node_list_uri[node_subject].append(node)\n",
    "\n",
    "    #--------------------------------------------\n",
    "  # FUSEKI操作\n",
    "  #--------------------------------------------  \n",
    "  def fetch_from_fuseki(query):\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://localhost:3030/akiyama\", returnFormat='json')\n",
    "    sparql.setQuery(query)\n",
    "    results = sparql.query().convert()\n",
    "    return results\n",
    "\n",
    "  def fetch_gpm(self):\n",
    "    query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      PREFIX d3: <http://digital-triplet.net/>\n",
    "      PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "      PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "      select distinct ?gen\n",
    "      where {\n",
    "        graph ?gen {\n",
    "          ?s ?p ?o;\n",
    "          pd3:epType \"gpm\".\n",
    "        }\n",
    "      }\n",
    "    \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    gpm_list = []\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "      gpm_list.append(result['gen']['value'])\n",
    "    return gpm_list\n",
    "  \n",
    "  def fetch_action(self, model):\n",
    "    query = \"\"\"\n",
    "        PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "        PREFIX d3: <http://digital-triplet.net/>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        select ?actionName\n",
    "        where {\n",
    "        graph <\"\"\"+model+\"\"\"> {\n",
    "            ?s a pd3:Action;\n",
    "            pd3:value ?actionName\n",
    "            FILTER (?actionName != \"Start\" && ?actionName != \"end\" && ?actionName != \"End\")\n",
    "        }\n",
    "        }\n",
    "    \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    print(results)\n",
    "    action_list = []\n",
    "    for result in results:\n",
    "      action_list.append(result['actionName']['value'])\n",
    "    return action_list\n",
    "\n",
    "  def fetch_lld_action(self, model, action_name):\n",
    "    query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      PREFIX d3aki: <http://DigitalTriplet.net/2021/11/ontology/akiyama#>\n",
    "      PREFIX d3: <http://digital-triplet.net/>\n",
    "      PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "      PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "      select ?log ?log_action ?log_action_name (COUNT(?event) as ?count)\n",
    "        where {\n",
    "          {GRAPH <\"\"\"+model+\"\"\">\n",
    "          {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\"+action_name+\"\"\"')\n",
    "          }\n",
    "          GRAPH ?log\n",
    "          {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "          }\n",
    "          GRAPH <http://localhost:3030/akiyama/data/event>\n",
    "          {\n",
    "            OPTIONAL{?event d3aki:eventType \"reference\";\n",
    "                          d3aki:referTo ?log_action}.}\n",
    "          }\n",
    "          UNION\n",
    "          {\n",
    "            GRAPH <\"\"\"+model+\"\"\">\n",
    "          {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\" +action_name+\"\"\"')\n",
    "          }\n",
    "          GRAPH ?log\n",
    "          {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "          }\n",
    "          }\n",
    "        }\n",
    "        group by ?log ?log_action ?log_action_name \n",
    "        order by DESC(?count)\n",
    "      \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    lld_action_list = []\n",
    "    for result in results:\n",
    "      lld_action_list.append(result['log_action_name']['value'])\n",
    "    return lld_action_list\n",
    "\n",
    "  def fetch_document(self, model, action_name):\n",
    "    query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "        PREFIX d3aki: <http://DigitalTriplet.net/2021/11/ontology/akiyama#>\n",
    "        PREFIX d3: <http://digital-triplet.net/>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        select ?documentTitle ?documentLink (COUNT(?event) as ?count)\n",
    "        where {\n",
    "        {\n",
    "            GRAPH <\"\"\"+model+\"\"\">\n",
    "            {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\"+action_name+\"\"\"')\n",
    "            }\n",
    "            GRAPH ?log\n",
    "            {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "                ?document d3aki:reference ?log_action;\n",
    "                        d3aki:documentURI ?documentURI.\n",
    "            }\n",
    "            GRAPH <http://localhost:3030/akiyama/data/document>\n",
    "            {\n",
    "            OPTIONAL{?documentURI d3aki:linkTo ?documentLink;\n",
    "                                    d3aki:title ?documentTitle}.\n",
    "            }\n",
    "            GRAPH <http://localhost:3030/akiyama/data/event>\n",
    "            {\n",
    "            OPTIONAL{?event d3aki:eventType \"reference\";\n",
    "                            d3aki:referTo ?documentURI;\n",
    "                            d3aki:referedTo ?log_action}.\n",
    "            }\n",
    "        }\n",
    "        UNION\n",
    "        {\n",
    "            GRAPH <\"\"\"+model+\"\"\">\n",
    "            {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\"+action_name+\"\"\"')\n",
    "            }\n",
    "            GRAPH ?log\n",
    "            {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "                ?document d3aki:reference ?log_action;\n",
    "                        d3aki:documentURI ?documentURI.\n",
    "            }\n",
    "            GRAPH <http://localhost:3030/akiyama/data/document>\n",
    "            {\n",
    "            OPTIONAL{?documentURI d3aki:linkTo ?documentLink;\n",
    "                                    d3aki:title ?documentTitle}.\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        group by ?documentTitle ?documentLink\n",
    "        order by DESC(?count)\n",
    "      \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    document_list = []\n",
    "    for result in results:\n",
    "      document_list.append(result['documentTitle']['value'])\n",
    "    return document_list\n",
    "\n",
    "  def fetch_engineer(self, model, action_name):\n",
    "    query=\"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      PREFIX d3aki: <http://DigitalTriplet.net/2021/11/ontology/akiyama#>\n",
    "      PREFIX d3: <http://digital-triplet.net/>\n",
    "      PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "      PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "      select ?log ?log_action ?log_action_name ?engineer ?engineerName ?engineerLink (COUNT(?event) as ?count)\n",
    "      where {\n",
    "        {\n",
    "          GRAPH <\"\"\"+model+\"\"\">\n",
    "          {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\"+action_name+\"\"\"')\n",
    "          }\n",
    "          GRAPH ?log\n",
    "          {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "              ?engineer d3aki:practitioner ?log_action;\n",
    "                        d3aki:engineerURI ?engineerURI;\n",
    "                        pd3:value ?engineerName.\n",
    "          }\n",
    "          GRAPH <http://localhost:3030/akiyama/data/engineer>\n",
    "          {\n",
    "            OPTIONAL{?engineerURI d3aki:linkTo ?engineerLink;\n",
    "                                  }.\n",
    "          }\n",
    "          GRAPH <http://localhost:3030/akiyama/data/event>\n",
    "          {\n",
    "            OPTIONAL{?event d3aki:eventType \"reference\";\n",
    "                            d3aki:referTo ?engineerURI;\n",
    "                            d3aki:referedTo ?log_action}.\n",
    "          }\n",
    "        }\n",
    "        UNION\n",
    "        {\n",
    "          GRAPH <\"\"\"+model+\"\"\">\n",
    "          {\n",
    "            ?s pd3:value ?action_name.\n",
    "            filter(?action_name = '\"\"\"+action_name+\"\"\"')\n",
    "          }\n",
    "          GRAPH ?log\n",
    "          {\n",
    "            ?log_ep pd3:epType \"lld\".\n",
    "            ?log_action rdfs:seeAlso ?s;\n",
    "            pd3:value ?log_action_name.\n",
    "              ?engineer d3aki:practitioner ?log_action;\n",
    "                        d3aki:engineerURI ?engineerURI;\n",
    "                        pd3:value ?engineerName.\n",
    "          }\n",
    "          GRAPH <http://localhost:3030/akiyama/data/engineer>\n",
    "          {\n",
    "            OPTIONAL{?engineerURI d3aki:linkTo ?engineerLink;\n",
    "                                  }.\n",
    "          }\n",
    "        }\n",
    "      }\n",
    "      group by ?log ?log_action ?log_action_name ?engineer ?engineerName ?engineerLink\n",
    "      order by DESC(?count)\n",
    "    \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    engineer_list = []\n",
    "    for result in results:\n",
    "      engineer_list.append(result['engineerName']['value'])\n",
    "    return engineer_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 167,
   "metadata": {},
   "outputs": [],
   "source": [
    "def select_graph(event):\n",
    "  w = event.widget\n",
    "  select_index = int(w.curselection()[0])\n",
    "  app.selected_graph = app.graph_list[select_index]\n",
    "  app.selected_graph_name = \"<\" + app.selected_graph + \">\"\n",
    "\n",
    "  # treeviewを更新のため、元のtreeviewを削除\n",
    "  if(app.treeview.get_children):\n",
    "    for item in app.treeview.get_children():\n",
    "      app.treeview.delete(item)\n",
    "\n",
    "  # gpm listの選択をクリア\n",
    "  app.listbox_gpm_uri_list.delete(0, tk.END)\n",
    "\n",
    "  # ノード情報をクリア\n",
    "  app.node_info_id_text.set(\"\")\n",
    "  app.node_info_action_text.set(\"\")\n",
    "  app.node_info_height_text.set(\"\")\n",
    "  app.node_info_width_text.set(\"\")\n",
    "  app.node_info_posx_text.set(\"\")\n",
    "  app.node_info_posy_text.set(\"\")\n",
    "  app.node_info_layer_text.set(\"\")\n",
    "  app.node_info_value_text.set(\"\")\n",
    "\n",
    "  app.get_top_node_list()\n",
    "  #print(app.node_list)\n",
    "  #print(app.node_id_list)\n",
    "  app.get_gpm_uri_list(app.node_list)\n",
    "\n",
    "  # グラフを表示のため、ttlファイルを取得\n",
    "  query_ttl_file = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      CONSTRUCT { ?s ?p ?o}\n",
    "      WHERE {\n",
    "            graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                  ?s ?p ?o;\n",
    "          }\n",
    "      }\n",
    "  \"\"\"\n",
    "  #print(query_ttl_file)\n",
    "  get_ttlfile_data(query_ttl_file, app.ttl_file)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 168,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_ttlfile_data(query, file_path):\n",
    "  #★\n",
    "  sparql = SPARQLWrapper(\"http://localhost:3030/akiyama/sparql\")\n",
    "  #★end\n",
    "  sparql.setQuery(query)\n",
    "\n",
    "  sparql.setReturnFormat(TURTLE)\n",
    "  results = sparql.query().convert()\n",
    "\n",
    "  with open(file_path, 'w', encoding = 'utf-8') as f:\n",
    "    #bytes型をdecodeでstr型に変換する\n",
    "    f.write(results.decode())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_graph_data_by_ttlfile(node_id_list, file_path):\n",
    "\n",
    "  node_list = []\n",
    "  edge_list = []\n",
    "  label_list = {}\n",
    "  position = {}\n",
    "  pd3 = Namespace('http://DigitalTriplet.net/2021/08/ontology#')\n",
    "\n",
    "  with open(file_path, 'r', encoding='utf-8') as f:\n",
    "    g = Graph()\n",
    "    g.parse(f)\n",
    "\n",
    "  for s, p, o in g.triples((None, RDF.type, None)):\n",
    "    # Action\n",
    "    if(o == pd3.Action):\n",
    "      for s1, p1, o1 in g.triples((s, pd3.id, None)):\n",
    "        id = str(o1)\n",
    "        if(id in node_id_list):\n",
    "          node_list.append(id)\n",
    "          for s2, p2, o2 in g.triples((s, pd3.geoBoundingX, None)):\n",
    "            #★\n",
    "            postion_x = float(o2)\n",
    "            #★end\n",
    "          for s3, p3, o3 in g.triples((s, pd3.geoBoundingY, None)):\n",
    "            #★\n",
    "            postion_y = float(o3)\n",
    "            #★end\n",
    "          position[id] = [postion_x, 1000-postion_y]\n",
    "          for s4, p4, o4 in g.triples((s, pd3.value, None)):\n",
    "            value = str(o4)\n",
    "            label_list[id] = value\n",
    "    # Flow\n",
    "    elif(o == pd3.Flow):\n",
    "      for s2, p2, o2 in g.triples((s, pd3.source, None)):\n",
    "        temp_source = o2\n",
    "      for s3, p3, o3 in g.triples((temp_source, pd3.id, None)):\n",
    "        source = str(o3)\n",
    "      for s2, p2, o2 in g.triples((s, pd3.target, None)):\n",
    "        temp_target = o2\n",
    "        for s3, p3, o3 in g.triples((temp_target, pd3.id, None)):\n",
    "          target = str(o3)\n",
    "      if(source in node_id_list) and (target in node_id_list):\n",
    "        edge_list.append((source, target, {\"color\" : \"k\"}))\n",
    "\n",
    "  return node_list, edge_list, label_list, position"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 170,
   "metadata": {},
   "outputs": [],
   "source": [
    "def tree_select(event):\n",
    "  # node名を取得\n",
    "  record_id = app.treeview.focus()\n",
    "  current_item = app.treeview.item(record_id)[\"text\"]\n",
    "\n",
    "  #print(record_id)\n",
    "  #print(app.graph_level)\n",
    "  #print(current_item)\n",
    "\n",
    "  #★\n",
    "  # node idを取得\n",
    "  for key in app.treeview_item_list.keys():\n",
    "    for index, item in enumerate(app.treeview_item_list[key]):\n",
    "      if(item == record_id):\n",
    "        node_id = app.node_id_list[key][index]\n",
    "        new_graph_level = key\n",
    "\n",
    "  # ノード情報表示ラベルをクリア\n",
    "  clear_info_label()\n",
    "\n",
    "  # ノード情報を取得(id, actionType, layer, position など)\n",
    "  get_node_info(current_item, node_id)\n",
    "\n",
    "  # 補足情報を取得(intention, annotation, rationale, objectなど)\n",
    "  get_supplement_info(current_item, node_id)\n",
    "\n",
    "  image_path = \"selected_graph.png\"\n",
    "  # 選択したノードの層と表示しているグラフの層が異なる場合、グラフ更新\n",
    "  if(new_graph_level != app.graph_level):\n",
    "    app.graph_level = new_graph_level\n",
    "\n",
    "    (app.graph_node_list, app.graph_edge_list, app.graph_label_list, app.graph_position) = \\\n",
    "      get_graph_data_by_ttlfile(app.node_id_list[app.graph_level], app.ttl_file)\n",
    "  \n",
    "  # 画像を設定\n",
    "  set_image(image_path, app.graph_node_list, app.graph_edge_list, app.graph_label_list, [node_id],\\\n",
    "            app.graph_position)\n",
    "\n",
    "  # 画像を更新\n",
    "  selected_image=Image.open(image_path)\n",
    "  change_image(selected_image)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 171,
   "metadata": {},
   "outputs": [],
   "source": [
    "def clear_info_label():\n",
    "  app.node_info_id_text.set(\"\")\n",
    "  app.node_info_action_text.set(\"\")\n",
    "  app.node_info_height_text.set(\"\")\n",
    "  app.node_info_width_text.set(\"\")\n",
    "  app.node_info_posx_text.set(\"\")\n",
    "  app.node_info_posy_text.set(\"\")\n",
    "  app.node_info_layer_text.set(\"\")\n",
    "  app.node_info_value_text.set(\"\")\n",
    "\n",
    "  app.intention_text.set(\"\")\n",
    "  app.rationale_text.set(\"\")\n",
    "  app.annotation_text.set(\"\")\n",
    "  app.tool_text.set(\"\")\n",
    "  app.object_text.set(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 172,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_node_info(node, node_id):\n",
    "\n",
    "  query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "      select distinct ?s ?id ?actionType ?height ?width ?pos_x ?pos_y ?layer ?type\n",
    "      where {\n",
    "            graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "            ?s pd3:id ?id;\n",
    "              pd3:actionType ?actionType;\n",
    "              pd3:geoBoundingHeight ?height;\n",
    "              pd3:geoBoundingWidth ?width;\n",
    "              pd3:geoBoundingX ?pos_x;\n",
    "              pd3:geoBoundingY ?pos_y;\n",
    "              pd3:layer ?layer;\n",
    "              rdf:type ?type.\n",
    "            }\n",
    "            FILTER(?id = \"\"\" + '\"' + node_id + '\"' + \"\"\")\n",
    "  }\"\"\"\n",
    "\n",
    "  query_result = get_fuseki_data_json(query)\n",
    "\n",
    "  \"\"\"\n",
    "  print(query)\n",
    "  print(query_result)\n",
    "  \"\"\"\n",
    "\n",
    "  for result in query_result:\n",
    "    id = result[\"id\"][\"value\"] \n",
    "    action = result[\"actionType\"][\"value\"]\n",
    "    height = result[\"height\"][\"value\"]\n",
    "    width = result[\"width\"][\"value\"]\n",
    "    pos_x = result[\"pos_x\"][\"value\"]\n",
    "    pos_y = result[\"pos_y\"][\"value\"]\n",
    "    layer = result[\"layer\"][\"value\"]\n",
    "\n",
    "  app.node_info_id_text.set(id)\n",
    "  app.node_info_action_text.set(action)\n",
    "  app.node_info_height_text.set(height)\n",
    "  app.node_info_width_text.set(width)\n",
    "  app.node_info_posx_text.set(pos_x)\n",
    "  app.node_info_posy_text.set(pos_y)\n",
    "  app.node_info_layer_text.set(layer)\n",
    "  app.node_info_value_text.set(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 173,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_supplement_info(node, node_id):\n",
    "\n",
    "  query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      SELECT ?s\n",
    "      WHERE {\n",
    "            graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "              ?s pd3:id ?id.\n",
    "          FILTER(?id = \"\"\" + '\"' + node_id + '\"' + \"\"\")\n",
    "          }\n",
    "      }\n",
    "  \"\"\"\n",
    "  query_result = get_fuseki_data_json(query)\n",
    "  for result in query_result:\n",
    "    target = result[\"s\"][\"value\"]\n",
    "\n",
    "  target = \"<\" + target + \">\"\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # intentionを取得\n",
    "  #------------------------------------------------------------------\n",
    "  (intention_id, intention_value) = get_supplement_detail_info(\"intention\", target)\n",
    "\n",
    "  if(intention_id is not None) and (intention_value is not None):\n",
    "    app.intention_text.set(intention_value)\n",
    "  \n",
    "  #------------------------------------------------------------------\n",
    "  # rationaleを取得\n",
    "  #------------------------------------------------------------------\n",
    "  (rationale_id, rationale_value) = get_supplement_detail_info(\"rationale\", target)\n",
    "\n",
    "  if(rationale_id is not None) and (rationale_value is not None):\n",
    "    app.rationale_text.set(rationale_value)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # annotationを取得\n",
    "  #------------------------------------------------------------------\n",
    "  (annotation_id, annotation_value) = get_supplement_detail_info(\"annotation\", target)\n",
    "\n",
    "  if(annotation_id is not None) and (annotation_value is not None):\n",
    "    app.annotation_text.set(annotation_value)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # toolを取得\n",
    "  #------------------------------------------------------------------\n",
    "  (tool_id, tool_value) = get_supplement_detail_info(\"tool/knowledge\", target)\n",
    "\n",
    "  if(tool_value is not None):\n",
    "    app.tool_text.set(tool_value)\n",
    "\n",
    "  #------------------------------------------------------------------\n",
    "  # objectを取得\n",
    "  #------------------------------------------------------------------\n",
    "  (object_id, object_value) = get_supplement_detail_info(\"\", target)\n",
    "\n",
    "  if(object_id is not None) and (object_value is not None):\n",
    "    app.object_text.set(object_value)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 174,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_supplement_detail_info(type, taget_id):\n",
    "\n",
    "  # オブジェクトではない場合\n",
    "  if(type != \"\"):\n",
    "    type = '\"'+ type + '\"'\n",
    "\n",
    "    query= \"\"\"\n",
    "        PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "        SELECT ?s ?id ?value\n",
    "        WHERE {\n",
    "              graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                ?s pd3:target ?target;\n",
    "                pd3:arcType ?arcType;\n",
    "                pd3:id ?id;\n",
    "                pd3:value ?value.\n",
    "            FILTER(?arcType = \"\"\" + type + \"\"\")\n",
    "            FILTER(?target = \"\"\" + taget_id + \"\"\")\n",
    "            }\n",
    "        }\n",
    "    \"\"\"\n",
    "    results = get_fuseki_data_json(query)\n",
    "    if(len(results) > 0):\n",
    "      for result in results:\n",
    "        subject = result[\"s\"][\"value\"]\n",
    "        id = result[\"id\"][\"value\"]\n",
    "        value = result[\"value\"][\"value\"]\n",
    "\n",
    "      return id, value\n",
    "\n",
    "  # オブジェクトの場合\n",
    "  else:\n",
    "    query_2 = \"\"\"\n",
    "        PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "        SELECT ?s \n",
    "        WHERE {\n",
    "              graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                ?s pd3:target ?target;\n",
    "                pd3:arcType ?arcType;\n",
    "                pd3:id ?id;\n",
    "                pd3:value ?value.\n",
    "            FILTER(?arcType = \"tool/knowledge\")\n",
    "            FILTER(?target = \"\"\" + taget_id + \"\"\")\n",
    "            }\n",
    "        }\n",
    "    \"\"\"\n",
    "    results_2 = get_fuseki_data_json(query_2)\n",
    "    if(len(results_2) > 0):\n",
    "      for result in results_2:\n",
    "        subject = result[\"s\"][\"value\"]\n",
    "\n",
    "      subject = \"<\" + subject + \">\"\n",
    "      object_query = \"\"\"\n",
    "          PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "          SELECT ?id ?value\n",
    "          WHERE {\n",
    "                graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                  ?s ?p pd3:Object;\n",
    "                  pd3:output ?output;\n",
    "                  pd3:id ?id;\n",
    "                  pd3:value ?value.\n",
    "              FILTER(?output = \"\"\" + subject + \"\"\")\n",
    "              }\n",
    "          }\n",
    "      \"\"\"\n",
    "      object_result = get_fuseki_data_json(object_query)\n",
    "      if(len(object_result) > 0):\n",
    "        for result in object_result:\n",
    "          object_id = result[\"id\"][\"value\"]\n",
    "          object_value = result[\"value\"][\"value\"]\n",
    "\n",
    "        return object_id, object_value\n",
    "\n",
    "  return None, None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 175,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_fuseki_data_json(query):\n",
    "  sparql = SPARQLWrapper(\"http://localhost:3030/akiyama\", returnFormat='json')\n",
    "  sparql.setQuery(query)\n",
    "\n",
    "  sparql.setReturnFormat(JSON)\n",
    "  results = sparql.query().convert()\n",
    "\n",
    "  return results[\"results\"][\"bindings\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 176,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_image(image_path, nodes, edges, labels, select_node, node_postion):\n",
    "  graph=nx.DiGraph()\n",
    "  graph.clear()\n",
    "  plt.clf()\n",
    "\n",
    "  #頂点を設定\n",
    "  graph.add_nodes_from(nodes)\n",
    "  #辺を設定\n",
    "  graph.add_edges_from(edges)\n",
    "\n",
    "  color_map = []\n",
    "  if not select_node:\n",
    "    color_map = ['tab:blue']\n",
    "  else:\n",
    "    for node in graph:\n",
    "        if node in select_node:\n",
    "          color_map.append('orange')\n",
    "        else:\n",
    "          color_map.append('tab:blue')\n",
    "\n",
    "  edge_color = [edge[\"color\"] for edge in graph.edges.values()]\n",
    "\n",
    "  #graph size\n",
    "  plt.figure(3,figsize=(8,8)) \n",
    "\n",
    "  #plt.margins(0.5, 0)\n",
    "  #node_size default=300\n",
    "  nx.draw(graph, with_labels=False, node_color=color_map, font_family='IPAexGothic',\\\n",
    "        node_size=500, pos=node_postion, edge_color=edge_color, width=2.0, alpha=0.5)\n",
    "\n",
    "  nx.draw_networkx_labels(graph, node_postion, labels, font_size=14, font_family='IPAexGothic',\\\n",
    "                          font_color='black')\n",
    "  #保存\n",
    "  plt.savefig(image_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "metadata": {},
   "outputs": [],
   "source": [
    "#--------------------------------------------\n",
    "# グラフ画像の入り替え処理\n",
    "#--------------------------------------------\n",
    "def change_image(img):\n",
    "  #canvasの書き換え\n",
    "  app.graph_canvas.photo = ImageTk.PhotoImage(img)\n",
    "  app.graph_canvas.itemconfig(app.image_on_canvas, image=app.graph_canvas.photo)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_gpm():\n",
    "  selected_GPM_index = app.listbox_gpm_uri_list.curselection()\n",
    "  if(len(selected_GPM_index)==0):\n",
    "    messagebox.showerror('Error', 'No uri data selected!')\n",
    "  else:\n",
    "    app.gpm_uri= app.listbox_gpm_uri_list.get(selected_GPM_index)\n",
    "\n",
    "  app.listbox_gpm_uri_list.select_clear(0, tk.END)\n",
    "  app.listbox_gpm_uri_list.delete(selected_GPM_index)\n",
    "\n",
    "  # treeviewを表示\n",
    "  app.get_hierarchy_node_list(app.gpm_uri)\n",
    "\n",
    "  # グラフを表示\n",
    "  show_top_graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 179,
   "metadata": {},
   "outputs": [],
   "source": [
    "def show_top_graph():\n",
    "  # グラフ情報を取得\n",
    "  (app.graph_node_list, app.graph_edge_list, app.graph_label_list, app.graph_position) = \\\n",
    "    get_graph_data_by_ttlfile(app.node_id_list[\"top\"], app.ttl_file)\n",
    "\n",
    "  # 最上層グラフを表示\n",
    "  image_path = \"top_graph.png\"\n",
    "  app.graph_level = \"top\"\n",
    "  set_image(image_path, app.graph_node_list, app.graph_edge_list, app.graph_label_list, [],\\\n",
    "          app.graph_position)\n",
    "  top_image=Image.open(image_path)\n",
    "\n",
    "  app.graph_canvas.photo = ImageTk.PhotoImage(top_image)\n",
    "  app.image_on_canvas = app.graph_canvas.create_image(0, 0, anchor='nw', image=app.graph_canvas.photo)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 180,
   "metadata": {},
   "outputs": [],
   "source": [
    "def set_relation():\n",
    "\n",
    "  # tree node名を取得\n",
    "  record_id = app.treeview.focus()\n",
    "  if(not record_id):\n",
    "    messagebox.showerror('Error', 'No node selected!')\n",
    "  else:\n",
    "    current_item = app.treeview.item(record_id)[\"text\"]\n",
    "\n",
    "  # member uriを取得\n",
    "  selected_member_index = app.listbox_gpm_uri_list.curselection()\n",
    "  if(len(selected_member_index)==0):\n",
    "    messagebox.showerror('Error', 'No uri data selected!')\n",
    "  else:\n",
    "    member_uri= app.listbox_gpm_uri_list.get(selected_member_index)\n",
    "\n",
    "  # relation typeを取得\n",
    "  selected_relation_index = app.list_relation_type.curselection()\n",
    "  if(len(selected_relation_index)==0):\n",
    "    messagebox.showerror('Error', 'No relation type selected!')\n",
    "  else:\n",
    "    relation_type= app.list_relation_type.get(selected_relation_index)\n",
    "\n",
    "  #print(current_item)\n",
    "  #print(member_uri)\n",
    "  #print(relation_type)\n",
    "\n",
    "  # 選択したノードのidを取得\n",
    "  for key in app.node_list.keys():\n",
    "    node_list = app.node_list[key]\n",
    "    for index, node in enumerate(node_list):\n",
    "      if(current_item == node):\n",
    "        current_node_id = app.node_id_list[key][index]\n",
    "        #print(current_node_id)\n",
    "\n",
    "  # 選択したノードのuriを取得\n",
    "  query = \"\"\"\n",
    "      PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "      SELECT ?s ?id\n",
    "      WHERE {\n",
    "            graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "              ?s pd3:id ?id\n",
    "          FILTER(?id = \"\"\" + '\"' + current_node_id + '\"' + \"\"\")\n",
    "          }\n",
    "      }\n",
    "  \"\"\"\n",
    "  query_result = get_fuseki_data_json(query)\n",
    "  for result in query_result:\n",
    "    subject = result[\"s\"][\"value\"]\n",
    "    id = result[\"id\"][\"value\"]\n",
    "    node_uri = subject.replace(id, \"\")\n",
    "\n",
    "  \"\"\"\n",
    "  print(current_item)\n",
    "  print(current_node_id)\n",
    "  print(node_uri)\n",
    "  print(member_uri)\n",
    "  \"\"\"\n",
    "\n",
    "  insert_relation(current_item, current_node_id, node_uri, member_uri, relation_type)\n",
    "\n",
    "  # treeview 更新\n",
    "  app.get_hierarchy_node_list(app.gpm_uri)\n",
    "\n",
    "  # graph 更新\n",
    "  show_top_graph()\n",
    "\n",
    "  # メンバー関連付けしたuriをGPM listから削除\n",
    "  app.listbox_gpm_uri_list.select_clear(0, tk.END)\n",
    "  app.listbox_gpm_uri_list.delete(selected_member_index)\n",
    "\n",
    "  # relation listに選択した項目をクリア\n",
    "  app.list_relation_type.select_clear(0, tk.END)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_relation(current_item, node_id, uri, member_uri, type):\n",
    "\n",
    "  fuseki_insert_data = []\n",
    "  member_node_list = []\n",
    "  pd3 = Namespace('http://DigitalTriplet.net/2021/08/ontology#')\n",
    "\n",
    "  if(type == 'member'):\n",
    "    #--------------------------------------------------------------\n",
    "    # memberとmemberのlayerを取得\n",
    "    #--------------------------------------------------------------\n",
    "    member_query = \"\"\"\n",
    "        PREFIX pd3: <http://DigitalTriplet.net/2021/08/ontology#>\n",
    "        SELECT distinct ?node ?layer\n",
    "        WHERE {\n",
    "          graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "            ?node ?p pd3:Action;\n",
    "                  pd3:layer ?layer\n",
    "            filter(regex(str(?node),\"\"\" + '\"' + member_uri + '\"' + \"\"\")) \n",
    "            FILTER NOT EXISTS {?node pd3:attribution ?parent}\n",
    "          }\n",
    "        }\n",
    "    \"\"\"\n",
    "    query_result = get_fuseki_data_json(member_query)\n",
    "    for result in query_result:\n",
    "      member_node_list.append(result[\"node\"][\"value\"])\n",
    "      layer = result[\"layer\"][\"value\"]\n",
    "\n",
    "    #--------------------------------------------------------------\n",
    "    # containerを追加\n",
    "    #--------------------------------------------------------------\n",
    "    # container名\n",
    "    container_name = ''.join(random.choice(string.ascii_letters + string.digits) for _ in range(22))\n",
    "\n",
    "    # RDF.type\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              RDF.type, pd3.Container])\n",
    "    # containerType\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.containerType, Literal('specialization')])\n",
    "    # contraction\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.contraction, URIRef(uri)+URIRef(node_id)])\n",
    "    # id\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.id, Literal(container_name)])\n",
    "    # geoBoundingHeight\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.geoBoundingHeight, Literal('200')])\n",
    "    # geoBoundingWidth\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.geoBoundingWidth, Literal('400')])\n",
    "    # layer\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.layer, Literal(layer)])\n",
    "    # member\n",
    "    for member in member_node_list:\n",
    "      fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.member, URIRef(member)])\n",
    "    # output\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.output, URIRef(uri)+URIRef(node_id)])\n",
    "    # value\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_name),\\\n",
    "                              pd3.value, Literal(current_item)])\n",
    "    #--------------------------------------------------------------\n",
    "    # expansionを追加\n",
    "    #--------------------------------------------------------------\n",
    "    fuseki_insert_data.append([URIRef(uri)+URIRef(current_item),\\\n",
    "                              pd3.expansion, URIRef(member_uri)+URIRef(container_name)])\n",
    "    #--------------------------------------------------------------\n",
    "    # memberのattributionを追加\n",
    "    #--------------------------------------------------------------\n",
    "    for member in member_node_list:\n",
    "      fuseki_insert_data.append([URIRef(member), pd3.attribution, \\\n",
    "                                URIRef(member_uri)+URIRef(container_name)])\n",
    "    #--------------------------------------------------------------\n",
    "    # container flowを追加\n",
    "    #--------------------------------------------------------------\n",
    "    container_flow_name = ''.join(random.choice(string.ascii_letters + string.digits) for _ in range(22))\n",
    "    # RDF.type\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              RDF.type, pd3.ContainerFlow])\n",
    "    # arcType\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.arcType, Literal('hierarchization')])\n",
    "    # id\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.id, Literal(container_flow_name)])\n",
    "    # layer\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.layer, Literal(layer)])\n",
    "    # source\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.source, URIRef(member_uri)+URIRef(container_name)])\n",
    "    # target\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.target, URIRef(uri)+URIRef(node_id)])\n",
    "    # value\n",
    "    fuseki_insert_data.append([URIRef(member_uri)+URIRef(container_flow_name),\\\n",
    "                              pd3.value, Literal(\"\")])\n",
    "\n",
    "  fuseki_insert(fuseki_insert_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 182,
   "metadata": {},
   "outputs": [],
   "source": [
    "def fuseki_insert(insert_data):\n",
    "  fuseki = FusekiUpdate('http://localhost:3030', 'd3')\n",
    "  g = Graph()\n",
    "\n",
    "  RdfUtils.add_list_to_graph(g, insert_data)\n",
    "  spo_str = '\\n'.join(\n",
    "      [f'{s.n3()} {p.n3()} {o.n3()}.' for (s, p, o) in g]\n",
    "  )\n",
    "\n",
    "  fuseki_query = \"\"\"\n",
    "                PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                INSERT DATA {\n",
    "                  GRAPH \"\"\" + app.selected_graph_name + \"{\" + spo_str + \"\"\"} }\"\"\"\n",
    "  fuseki.run_sparql(fuseki_query)\n",
    "\n",
    "  messagebox.showinfo('確認', 'Fusekiにインサートしました！')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 183,
   "metadata": {},
   "outputs": [],
   "source": [
    "def fuseki_export():\n",
    "  if (not app.selected_graph_name):\n",
    "    messagebox.showerror('Error', 'No graph selected！')\n",
    "  else:\n",
    "    file_path = 'fuseki_browser_export.ttl'\n",
    "    query = \"\"\"CONSTRUCT {?subject ?predicate ?object}\n",
    "              WHERE {\n",
    "                      graph \"\"\" + app.selected_graph_name + \"\"\" {\n",
    "                      ?subject ?predicate ?object\n",
    "                      }\n",
    "                    }\"\"\"\n",
    "    get_ttlfile_data(query, file_path)\n",
    "    messagebox.showinfo('確認', 'ttlファイルをエクスポートしました！')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 184,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/site-packages/SPARQLWrapper/Wrapper.py\", line 1073, in _query\n",
      "    response = urlopener(request)\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 222, in urlopen\n",
      "    return opener.open(url, data, timeout)\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 531, in open\n",
      "    response = meth(req, response)\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 640, in http_response\n",
      "    response = self.parent.error(\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 569, in error\n",
      "    return self._call_chain(*args)\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 502, in _call_chain\n",
      "    result = func(*args)\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/urllib/request.py\", line 649, in http_error_default\n",
      "    raise HTTPError(req.full_url, code, msg, hdrs, fp)\n",
      "urllib.error.HTTPError: HTTP Error 400: Can't determine output content type: turtle\n",
      "\n",
      "During handling of the above exception, another exception occurred:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/810004231.py\", line 41, in select_graph\n",
      "    get_ttlfile_data(query_ttl_file, app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/3137936716.py\", line 8, in get_ttlfile_data\n",
      "    results = sparql.query().convert()\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/site-packages/SPARQLWrapper/Wrapper.py\", line 1107, in query\n",
      "    return QueryResult(self._query())\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/site-packages/SPARQLWrapper/Wrapper.py\", line 1077, in _query\n",
      "    raise QueryBadFormed(e.read())\n",
      "SPARQLWrapper.SPARQLExceptions.QueryBadFormed: QueryBadFormed: a bad request has been sent to the endpoint, probably the sparql query is bad formed. \n",
      "\n",
      "Response:\n",
      "b\"Error 400: Can't determine output content type: turtle\\n\"\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1370965459.py\", line 15, in set_gpm\n",
      "    show_top_graph()\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1221935274.py\", line 4, in show_top_graph\n",
      "    get_graph_data_by_ttlfile(app.node_id_list[\"top\"], app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1811792746.py\", line 9, in get_graph_data_by_ttlfile\n",
      "    with open(file_path, 'r', encoding='utf-8') as f:\n",
      "FileNotFoundError: [Errno 2] No such file or directory: 'ttl_file.ttl'\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1689898511.py\", line 33, in tree_select\n",
      "    get_graph_data_by_ttlfile(app.node_id_list[app.graph_level], app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1811792746.py\", line 9, in get_graph_data_by_ttlfile\n",
      "    with open(file_path, 'r', encoding='utf-8') as f:\n",
      "FileNotFoundError: [Errno 2] No such file or directory: 'ttl_file.ttl'\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1689898511.py\", line 33, in tree_select\n",
      "    get_graph_data_by_ttlfile(app.node_id_list[app.graph_level], app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1811792746.py\", line 9, in get_graph_data_by_ttlfile\n",
      "    with open(file_path, 'r', encoding='utf-8') as f:\n",
      "FileNotFoundError: [Errno 2] No such file or directory: 'ttl_file.ttl'\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1689898511.py\", line 33, in tree_select\n",
      "    get_graph_data_by_ttlfile(app.node_id_list[app.graph_level], app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1811792746.py\", line 9, in get_graph_data_by_ttlfile\n",
      "    with open(file_path, 'r', encoding='utf-8') as f:\n",
      "FileNotFoundError: [Errno 2] No such file or directory: 'ttl_file.ttl'\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1689898511.py\", line 33, in tree_select\n",
      "    get_graph_data_by_ttlfile(app.node_id_list[app.graph_level], app.ttl_file)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/1811792746.py\", line 9, in get_graph_data_by_ttlfile\n",
      "    with open(file_path, 'r', encoding='utf-8') as f:\n",
      "FileNotFoundError: [Errno 2] No such file or directory: 'ttl_file.ttl'\n",
      "Exception in Tkinter callback\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/LEON/.pyenv/versions/3.8.5/lib/python3.8/tkinter/__init__.py\", line 1883, in __call__\n",
      "    return self.func(*args)\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/2602667945.py\", line 347, in <lambda>\n",
      "    command=lambda: self.insert_document_list(self))\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/2602667945.py\", line 382, in insert_document_list\n",
      "    document_list = self.fetch_document(app.selected_graph, self.node_info_value_text.get())\n",
      "  File \"/var/folders/sl/zz189s910nz3x298vr_xnz940000gp/T/ipykernel_70255/2602667945.py\", line 751, in fetch_document\n",
      "    for result in results[\"results\"][\"bindings\"]:\n",
      "TypeError: list indices must be integers or slices, not str\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "  # Windowを生成する。\n",
    "  root = tk.Tk()\n",
    "  app = Application(master=root)\n",
    "  # Windowをループさせて、継続的にWindow表示させる。\n",
    "  app.mainloop()"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "a969245137d59580e0936f89cd1685f7583c3202a3fc292fa16de8e009970426"
  },
  "kernelspec": {
   "display_name": "Python 3.8.5 64-bit ('3.8.5': pyenv)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
